{
  "type": "dir",
  "contents": {
    "education": {
      "type": "dir",
      "contents": {
        "Sun_Yat-sen_University_2010-2014.md": {
          "type": "file",
          "content": "# Sun Yat-sen University (2010 ~ 2014)\n\nI was directly admitted to Sun Yat-sen University due to my achievements in high school competitive programming, which sparked a deep passion for coding. I participated in the programming contest twice, failing the first time with a low score. However, I believed in my passion, persevered, and ultimately succeeded, despite others urging me to abandon this path. This success really gave me a lot of confidence in my life. \n\nDuring college, my enthusiasm for programming was overshadowed by personal loss; I lost my grandparents, who raised me, one after the other. These experiences left me with profound sadness and a quest to understand life’s deeper meaning.\n\nIn those years, I immersed myself in learning far beyond computer science and my major is information system and information management. I read extensively—hundreds of books across disciplines including economics, physics, philosophy, and management. I market some of books in [here](https://www.douban.com/people/waterfiredm/). I took classes on subjects from philosophy to advanced mathematics and even a course on cultivating plants. Despite my dedication, spending countless hours in the library, I still felt an unshakable emptiness.\n\nA transformative experience came when I traveled to Tibet. The altitude sickness was challenging at first, but as I recovered, I witnessed something extraordinary: a halo of light surrounding the sun. Later, in Tibet’s most renowned temple, I heard a voice—whether in my mind or resonating from the temple itself, I’m not sure. In that moment, I felt a deep sense of peace and fulfillment that stayed with me. Then I came back to coding world.\n\nI decided to pursue a graduate degree after university, driven by my passion for abstract thinking, theory, and problem-solving. I applied to Zhejiang University twice, failing the entrance examination the first time. Despite my poor performance, I retained my confidence and took a trip to Taiwan before attempting the exam again. Unfortunately, I was involved in a traffic accident during my trip and nearly lost my life. After recovering from my injuries, I dedicated myself to a six-month preparation period for the graduate school entrance examination. Ultimately, I achieved a high score and succeeded in my application. I was really excited to have a chance to work in the best computer graphics reasearch lab in China."
        },
        "Zhejiang_University_2015-2018.md": {
          "type": "file",
          "content": "# Zhejiang University (2015 ~ 2018)\n\nI pursued a master's degree in Computer Science at Zhejiang University which is the top university in China, where my research focus was on hexahedron mesh operations, a field that combines computer graphics and simulation calculations. I would like to thank my supervisor, Prof. Gao, who provided me with rigorous academic training and encouraged me to think abstractly and come up with innovative ideas. I made significant progress in my research capabilities and problem-solving skills during my graduate studies. I still vividly remember the day I first met Prof. Gao and expressed my desire to tackle challenging work.\n\nIn addition to my academic pursuits, I also made an effort to expand my social circle, not only within my lab but also throughout the entire graduate school and beyond. I made many close friends and had a wonderful time. I maintained my habit of reading extensively and taking courses in various subjects beyond computer science. I even took a course in Tai Chi, which helped me to relax and find balance in life. After years of struggle, I finally overcame the deep depression that had plagued me since my grandfather's passing.\n\nDuring the summer vacation, I persuaded Prof. Gao to let me intern at Microsoft instead of continuing research in the lab. At the time, no student from our lab had pursued an internship, as the focus was typically on research during the summer. After securing his approval, I joined Microsoft as a data scientist intern, where I applied machine learning algorithms to optimize Bing search results. My efforts paid off when I ranked at the top of my team's internship performance and received a job offer from Microsoft. I am especially grateful to my mentor, Hui, for supporting me, despite my limited practical experience with machine learning. The internship was highly challenging; for the first two months, my offline experiments yielded no positive results. However, through persistence and problem-solving, I achieved a significant breakthrough by the end of the program.\n\nOverall, my graduate studies helped me build a solid foundation in computer science, compensating for the gaps I had during my undergraduate years."
        }
      }
    },
    "project": {
      "type": "dir",
      "contents": {}
    },
    "readme.md": {
      "type": "file",
      "content": "# About Me\n\nHi, and welcome!\n\nI’m dimen61, a software engineer from China with a passion for innovation, problem-solving and coding. My journey in programming began in high school through competitive programming, which sparked my interest in abstract thinking and using code to solve complex challenges. This enthusiasm led me to pursue a bachelor’s degree in Management Information Systems and a master’s degree in Computer Science. \n\nSince then, I’ve been fortunate to work on impactful projects at companies like Xiaomi and Microsoft. At Xiaomi, I developed platforms and machine learning models to predict user click rates for ads, blending backend development with data science. Later, at Microsoft, I focused on backend features to improve shopping experiences on the Bing search platform.\n\nFor me, programming is far more than a career — it’s a craft and a constant source of inspiration. The process of blending logic with creativity, seeing ideas come to life, and achieving that “flow” state is what keeps me motivated. Even after taking a two-year break to explore new areas, my passion for coding has only deepened.\n\nThis site is my personal project, designed to reflect my love for technology in an interactive way. Built like a terminal, you can navigate using Linux-style commands to uncover my story and explore more about my journey. I hope you enjoy discovering it as much as I enjoyed creating it!\n\n## Help\n\nThis terminal supports two groups of commands to explore more about my journey:\n\n**Navigation commands:**\n- `ls` to list all files and directories\n- `cd` to switch to a different directory\n- `pwd` to print your current working directory\n\n**Display the content of a file:**\n- `cat` to display the content of a file\n\nPlease use `help` command to get all support commands.\n\n## Connection\n\n- Email: dimen61@gmail.com\n- Blog: https://dimen61.github.io\n- X: @dimen61\n"
    },
    "skills.md": {
      "type": "file",
      "content": "# Skills\n\n## Overview\n\nMy technical expertise spans backend development and data science, primarily focusing on building projects showcased in the **project** folder.\n\n## Python\n\nWith over a decade of experience in Python, I can quickly understand and contribute to any Python-based project. My skills include:\n\n- **Backend Development**: Building robust web applications using Django.\n- **AI & Machine Learning**: Training models with various AI frameworks.\n- **Data Engineering**: Developing pipelines for AI model training and data processing.\n- **Data Analysis**: Conducting analyses to guide feature decisions and optimize AI models.\n- **Automation**: Creating tools to streamline daily workflows.\n- **Prototyping**: Rapidly developing research prototypes.\n\n## Java\n\nI have two years of experience as a backend developer using Java, where I:\n- **Web Development**: Built backend services using the Spring Boot framework.\n- **Data Processing**: Developed tools for offline data processing.\n- **Big Data**: Leveraged Spark for large-scale data operations.\n\n## C++\n\nMost of my C++ work has been research-focused, where I:\n- **Algorithm Development**: Implemented data structures and algorithms for mesh research.\n- **Optimization**: Enhanced AI model training algorithms for better performance.\n\n## Linux & shell\n\nMy Linux knowledge enables efficient development of backend services, AI model training, and intensive data processing tasks. I create data pipelines and automation scripts using shell commands to optimize workflows.\n\n## Html, CSS & JS\n\nWhile I haven’t applied front-end skills in industry projects, I use HTML, CSS, and JavaScript in personal projects, including this site. These skills allow me to create useful tools and explore web development creatively.\n\n## Human language\n\n### Chinese\n\nI’m a native Chinese speaker and an essayist — some of my work is published [here](https://dimen61.github.io). I feel confident in my Chinese writing abilities.\n\n### English\n\nI am fluent in English, both written and spoken. During my time at Microsoft, I collaborated effectively with colleagues across the U.S., France, and India, using English for all communications."
    },
    "work": {
      "type": "dir",
      "contents": {
        "Microsoft.md": {
          "type": "file",
          "content": "# Microsoft Work Experience\n\nI have two work experiences in Microsoft. The first one is summer internship and the second one is full time job.\n\n## Summer internship (2017)\n\n\n\n## Fulltime job (2020 ~ 2022)\n\n"
        },
        "Xiaomi.md": {
          "type": "file",
          "content": "# Xiaomi Work Experience\n\n## Fulltime job (2018 ~ 2020)"
        }
      }
    }
  }
}